{
  "movies": [{
    "title" : "Days of Being Wild (A Fei zheng chuan) (1990)",
    "episode_number" : "days-of-being-wild",
    "main_characters" : ["Leslie Cheung", "Maggie Cheung", "Andy Lau", "Padmé Amidala", "Carina Lau", "Rebecca Pan", "Jacky Cheung"],
    "description" : "Set in 1960, the film centres on the young, boyishly handsome Yuddy, who learns from the drunken ex-prostitute who raised him that she is not his real mother. Hoping to hold onto him, she refuses to divulge the name of his real birth mother. The revelation shakes Yuddy to his very core, unleashing a cascade of conflicting emotions. Two women have the bad luck to fall for Yuddy. One is a quiet lass named Su Lizhen who works at a sports arena, while the other is a glitzy showgirl named Mimi. Perhaps due to his unresolved Oedipal issues, he passively lets the two compete for him, unable or unwilling to make a choice. As Lizhen slowly confides her frustration to a cop named Tide, he falls for her. The same is true for Yuddy's friend Zeb, who falls for Mimi. Later, Yuddy learns of his birth mother's whereabouts and heads out to the Philippines.",
    "poster" : "days_of_being_wild.jpg",
    "hero_image" : "days_of_being_wild_hero.jpg"
  },

  {
    "title" : "In the Mood for Love (Faa yeung nin wa) (2000)",
    "episode_number" : "in-the-mood-for-love",
    "main_characters" : ["Maggie Cheung", "Anakin Skywalker", "Tony Leung", "Ping Lam Siu", "Tung Cho 'Joe' Cheung", "Rebecca Pan", "Kelly Lai Chen"],
    "description" : "Set in Hong Kong, 1962, Chow Mo-Wan is a newspaper editor who moves into a new building with his wife. At the same time, Su Li-zhen, a beautiful secretary and her executive husband also move in to the crowded building. With their spouses often away, Chow and Li-zhen spend most of their time together as friends. They have everything in common from noodle shops to martial arts. Soon, they are shocked to discover that their spouses are having an affair. Hurt and angry, they find comfort in their growing friendship even as they resolve not to be like their unfaithful mates.",
    "poster" : "in_the_mood for_love_poster.jpg",
    "hero_image" : "in_the_mood for_love_hero.jpg"
  },

  {
    "title" : "Fallen Angels (Do lok tin si) (1995)",
    "episode_number" : "fallen-angels",
    "main_characters" : ["Leon Lai", "Michelle Reis", "Takeshi Kaneshiro", "Charlie Yeung", "Karen Mok", "Fai-Hung Chan", "Man-Lei Chan"],
    "description" : "A disillusioned killer embarks on his last hit but first he has to overcome his affections for his cool, detached partner. Thinking it's dangerous and improper to become involved with a colleague he sets out to find a surrogate for his affections. Against the sordid and surreal urban nightscape (set in contemporary Hong Kong), he crosses path with a strange drifter looking for her mysterious ex-boyfriend and an amusing mute trying to get the world's attention in his own unconventional ways.",
    "poster" : "fallen_angels_poster.jpg",
    "hero_image" : "fallen_angels_hero.jpg"
  },

  {
    "title" : "2046 (2004)",
    "episode_number" : "2046",
    "main_characters" : ["Tony Leung", "Li Gong", "Faye Wong", "Takuya Kimura", "Ziyi Zhang", "Carina Lau", "Chen Chang", "Jie Dong", "Maggie Cheung"],
    "description" : "The story evolves around the main character, Zhou Mo Wan who writes a novel about a mysterious train that leaves for a place called 2046 every once in a while. Everyone who boards that train has the same intention - which is to recapture their lost memories. It is said that in 2046, nothing ever changed. Nobody knows for sure if it was true, because nobody who went there had ever come back- except for one. He had been there but He chose to leave. He wanted to change.",
    "poster" : "2046_poster.jpg",
    "hero_image" : "2046_hero.jpg"
  },

  {
    "title" : "As Tears Go By (Wang Jiao ka men) (1988)",
    "episode_number" : "as-tears-go-by",
    "main_characters" : ["Andy Lau", "Maggie Cheung", "Jacky Cheung", "Alex Man", "Ronald Wong", "To-Hoi Kong", "Ching Wai", "Kau Lam", "William Chang"],
    "description" : "A low-level triad 'big brother' has a hot-tempered 'little brother' who can't keep out of trouble, and consequently is in constant need of being bailed out by his protector. The 'big brother' is super cool, but lacks the ambition to rise in the ranks of the triad societies - and once he meets his cousin from Kowloon and falls in love with her, he even thinks about leaving 'the life'.",
    "poster" : "as_tears_go_by_poster.jpg",
    "hero_image" : "as_tears_go_by_hero.jpg"
  },

  {
    "title" : "Chungking Express (Chung Hing sam lam) (1994)",
    "episode_number" : "chungking-express",
    "main_characters" : ["Tony Leung", "Faye Wong", "Takeshi Kaneshiro", "Valerie Chow", "Jinquan Chen", "Lee-Na Kwan", "Zhiming Huang"],
    "description" : "Wong Kar-Wai's movie about two love-struck cops is filmed in impressionistic splashes of motion and color. The first half deals with Cop 223, who has broken up with his girlfriend of five years. He purchases a tin of pineapples with an expiration date of May 1 each day for a month. By the end of that time, he feels that he will either be rejoined with his love or that it too will have expired forever. The second half shows Cop 663 dealing with his breakup with his flight attendant girlfriend. He talks to his apartment furnishings until he meets a new girl at a local lunch counter.",
    "poster" : "chungking_expres_poster.jpg",
    "hero_image" : "chungking_expres_hero.jpg"
  }]

}